//----------------------------------------------------------------------
//  $Id: InterruptUtils.cpp,v 1.50 2007/05/26 16:00:42 btittelbach Exp $
//----------------------------------------------------------------------
//
//  $Log: InterruptUtils.cpp,v $
//  Revision 1.49  2007/01/11 13:36:11  btittelbach
//  one of many more sanity checks to come
//
//  Revision 1.48  2006/10/13 11:38:12  btittelbach
//  Ein Bissal Uebersichtlichkeit im Bochs Terminal (aka loopende kprintfs auskomentiert)
//
//  Revision 1.47  2005/11/20 21:18:08  nelles
//
//       Committing in .
//
//        Another block device update ... Interrupts are now functional fixed some
//        8259 problems .. Reads and Writes tested  ....
//
//       Modified Files:
//   	include/arch_bd_ata_driver.h include/arch_bd_request.h
//   	include/arch_bd_virtual_device.h source/8259.cpp
//   	source/ArchInterrupts.cpp source/InterruptUtils.cpp
//   	source/arch_bd_ata_driver.cpp
//   	source/arch_bd_virtual_device.cpp source/arch_interrupts.s
//
//  Revision 1.46  2005/10/24 21:28:04  nelles
//
//   Fixed block devices. I think.
//
//   Committing in .
//
//   Modified Files:
//
//   	arch/x86/include/arch_bd_ata_driver.h
//   	arch/x86/source/InterruptUtils.cpp
//   	arch/x86/source/arch_bd_ata_driver.cpp
//   	arch/x86/source/arch_bd_ide_driver.cpp
//   	arch/xen/source/arch_bd_ide_driver.cpp
//
//   	common/source/kernel/SpinLock.cpp
//   	common/source/kernel/Thread.cpp utils/bochs/bochsrc
//

//  Solution to Userspace Bug still missing....
//
//  Revision 1.23  2005/08/03 11:56:56  btittelbach
//  Evil PageFaultBug now gets bigger... (but hopefully better to debug)
//
//  Revision 1.22  2005/08/02 19:47:54  btittelbach
//  Syscalls: there is some very evil bug still hidden here, what did I forget ?
//
//  Revision 1.21  2005/07/26 17:45:25  nomenquis
//  foobar
//
//  Revision 1.20  2005/07/24 17:02:59  nomenquis
//  lots of changes for new console stuff
//
//  Revision 1.19  2005/07/21 19:08:40  btittelbach
//  Jö schön, Threads u. Userprozesse werden ordnungsgemäß beendet
//  Threads können schlafen, Mutex benutzt das jetzt auch
//  Jetzt muß nur der Mutex auch überall verwendet werden
//
//  Revision 1.18  2005/07/21 11:50:06  btittelbach
//  Basic Syscall
//
//  Revision 1.17  2005/07/12 21:05:38  btittelbach
//  Lustiges Spielen mit UserProgramm Terminierung
//
//  Revision 1.16  2005/07/06 13:29:37  btittelbach
//  testing
//
//  Revision 1.15  2005/07/05 20:22:56  btittelbach
//  some changes
//
//  Revision 1.14  2005/07/05 17:29:48  btittelbach
//  new kprintf(d) Policy:
//  [Class::]Function: before start of debug message
//  Function can be abbreviated "ctor" if Constructor
//  use kprintfd where possible
//
//  Revision 1.13  2005/06/14 18:51:47  btittelbach
//  afterthought page fault handling
//
//  Revision 1.12  2005/06/14 18:22:37  btittelbach
//  RaceCondition anfälliges LoadOnDemand implementiert,
//  sollte optimalerweise nicht im InterruptKontext laufen
//
//  Revision 1.11  2005/06/14 15:49:11  nomenquis
//  ohhh hilfe
//
//  Revision 1.10  2005/06/14 13:54:55  nomenquis
//  foobarpratz
//
//  Revision 1.9  2005/06/04 19:41:26  nelles
//
//  Serial ports now fully fuctional and tested ....
//
//  Revision 1.8  2005/05/31 17:29:16  nomenquis
//  userspace
//
//  Revision 1.7  2005/05/25 08:27:48  nomenquis
//  cr3 remapping finally really works now
//
//  Revision 1.6  2005/04/27 09:19:20  nomenquis
//  only pack whats needed
//
//  Revision 1.5  2005/04/26 15:58:45  nomenquis
//  threads, scheduler, happy day
//
//  Revision 1.4  2005/04/26 13:34:23  nomenquis
//  whatever
//
//  Revision 1.3  2005/04/25 21:15:41  nomenquis
//  lotsa changes
//
//  Revision 1.2  2005/04/24 20:39:31  nomenquis
//  cleanups
//
//  Revision 1.1  2005/04/24 16:58:04  nomenquis
//  ultra hack threading
//
//----------------------------------------------------------------------



#include "InterruptUtils.h"
#include "new.h"
#include "arch_panic.h"
#include "ports.h"
#include "ArchMemory.h"
#include "ArchThreads.h"
#include "ArchCommon.h"
#include "Console.h"
#include "Terminal.h"
#include "kprintf.h"
#include "Scheduler.h"
#include "debug_bochs.h"

#include "arch_serial.h"
#include "serial.h"
#include "arch_keyboard_manager.h"
#include "arch_bd_manager.h"

#include "Thread.h"
#include "ArchInterrupts.h"

//remove this later
#include "Thread.h"
#include "Loader.h"
#include "Syscall.h"
#include "paging-definitions.h"

  extern "C" void arch_dummyHandler();

// thanks mona
typedef struct {
    uint16 offsetL;  /*!< 0-15bit of offset address */
    uint16 selector; /*!< selector address          */
    uint8 unused;   /*!< unused                    */
    uint8 type;     /*!< type                      */
    uint16 offsetH;  /*!< 16-32bit of offset address */
}__attribute__((__packed__)) GateDesc;


void InterruptUtils::initialise()
{
  uint32 i;
  
  // ok, allocate some memory for our neat lil' handlers
  GateDesc *interrupt_gates = new GateDesc[NUM_INTERRUPT_HANDLERS];
  
  for (i=0;i<NUM_INTERRUPT_HANDLERS;++i)
  {
    interrupt_gates[i].offsetL  = ((uint32)(handlers[i].handler)) & 0x0000FFFF;
    interrupt_gates[i].offsetH  = (((uint32)(handlers[i].handler)) & 0xFFFF0000) >> 16;
#warning FIXME, THIS IS REALLY BAD VOODOO !
    interrupt_gates[i].selector = 8*3;
    interrupt_gates[i].type     = handlers[i].number == 0x80 ? 0xEE : 0x8E; /* System call use 0x80 */
    interrupt_gates[i].unused   = 0x00;
  }


  IDTR *idtr = new IDTR();
  idtr->base = (uint32)interrupt_gates;
  idtr->limit = sizeof(GateDesc)*NUM_INTERRUPT_HANDLERS -1;

  lidt(idtr);
  
}

void InterruptUtils::lidt(IDTR *idtr)
{
  asm volatile("lidt (%0) ": :"q" (idtr));
}

//~ void InterruptUtils::enableInterrupts()
//~ {
  
//~ }

//~ void InterruptUtils::disableInterrupts()
//~ {
  
//~ }
#define DUMMY_HANDLER(x) extern "C" void arch_dummyHandler_##x(); \
  extern "C" void dummyHandler_##x () \
  {\
    kprintfd_nosleep("DUMMY_HANDLER: Spurious INT " #x "\n");\
    kprintf_nosleep("DUMMY_HANDLER: Spurious INT " #x "\n");\
  }

DUMMY_HANDLER(0)
DUMMY_HANDLER(1)
DUMMY_HANDLER(2)
DUMMY_HANDLER(3)
DUMMY_HANDLER(4)
DUMMY_HANDLER(5)
DUMMY_HANDLER(6)
DUMMY_HANDLER(7)
DUMMY_HANDLER(8)
DUMMY_HANDLER(9)
DUMMY_HANDLER(10)
DUMMY_HANDLER(11)
DUMMY_HANDLER(12)
DUMMY_HANDLER(13)
DUMMY_HANDLER(14)
DUMMY_HANDLER(15)
DUMMY_HANDLER(16)
DUMMY_HANDLER(17)
DUMMY_HANDLER(18)
DUMMY_HANDLER(19)
DUMMY_HANDLER(20)
DUMMY_HANDLER(21)
DUMMY_HANDLER(22)
DUMMY_HANDLER(23)
DUMMY_HANDLER(24)
DUMMY_HANDLER(25)
DUMMY_HANDLER(26)
DUMMY_HANDLER(27)
DUMMY_HANDLER(28)
DUMMY_HANDLER(29)
DUMMY_HANDLER(30)
DUMMY_HANDLER(31)
DUMMY_HANDLER(32)
DUMMY_HANDLER(33)
DUMMY_HANDLER(34)
DUMMY_HANDLER(35)
DUMMY_HANDLER(36)
DUMMY_HANDLER(37)
DUMMY_HANDLER(38)
DUMMY_HANDLER(39)
DUMMY_HANDLER(40)
DUMMY_HANDLER(41)
DUMMY_HANDLER(42)
DUMMY_HANDLER(43)
DUMMY_HANDLER(44)
DUMMY_HANDLER(45)
DUMMY_HANDLER(46)
DUMMY_HANDLER(47)
DUMMY_HANDLER(48)
DUMMY_HANDLER(49)
DUMMY_HANDLER(50)
DUMMY_HANDLER(51)
DUMMY_HANDLER(52)
DUMMY_HANDLER(53)
DUMMY_HANDLER(54)
DUMMY_HANDLER(55)
DUMMY_HANDLER(56)
DUMMY_HANDLER(57)
DUMMY_HANDLER(58)
DUMMY_HANDLER(59)
DUMMY_HANDLER(60)
DUMMY_HANDLER(61)
DUMMY_HANDLER(62)
DUMMY_HANDLER(63)
DUMMY_HANDLER(64)
DUMMY_HANDLER(65)
DUMMY_HANDLER(66)
DUMMY_HANDLER(67)
DUMMY_HANDLER(68)
DUMMY_HANDLER(69)
DUMMY_HANDLER(70)
DUMMY_HANDLER(71)
DUMMY_HANDLER(72)
DUMMY_HANDLER(73)
DUMMY_HANDLER(74)
DUMMY_HANDLER(75)
DUMMY_HANDLER(76)
DUMMY_HANDLER(77)
DUMMY_HANDLER(78)
DUMMY_HANDLER(79)
DUMMY_HANDLER(80)
DUMMY_HANDLER(81)
DUMMY_HANDLER(82)
DUMMY_HANDLER(83)
DUMMY_HANDLER(84)
DUMMY_HANDLER(85)
DUMMY_HANDLER(86)
DUMMY_HANDLER(87)
DUMMY_HANDLER(88)
DUMMY_HANDLER(89)
DUMMY_HANDLER(90)
DUMMY_HANDLER(91)
DUMMY_HANDLER(92)
DUMMY_HANDLER(93)
DUMMY_HANDLER(94)
DUMMY_HANDLER(95)
DUMMY_HANDLER(96)
DUMMY_HANDLER(97)
DUMMY_HANDLER(98)
DUMMY_HANDLER(99)
DUMMY_HANDLER(100)
DUMMY_HANDLER(101)
DUMMY_HANDLER(102)
DUMMY_HANDLER(103)
DUMMY_HANDLER(104)
DUMMY_HANDLER(105)
DUMMY_HANDLER(106)
DUMMY_HANDLER(107)
DUMMY_HANDLER(108)
DUMMY_HANDLER(109)
DUMMY_HANDLER(110)
DUMMY_HANDLER(111)
DUMMY_HANDLER(112)
DUMMY_HANDLER(113)
DUMMY_HANDLER(114)
DUMMY_HANDLER(115)
DUMMY_HANDLER(116)
DUMMY_HANDLER(117)
DUMMY_HANDLER(118)
DUMMY_HANDLER(119)
DUMMY_HANDLER(120)
DUMMY_HANDLER(121)
DUMMY_HANDLER(122)
DUMMY_HANDLER(123)
DUMMY_HANDLER(124)
DUMMY_HANDLER(125)
DUMMY_HANDLER(126)
DUMMY_HANDLER(127)
//DUMMY_HANDLER(128)
DUMMY_HANDLER(129)
DUMMY_HANDLER(130)
DUMMY_HANDLER(131)
DUMMY_HANDLER(132)
DUMMY_HANDLER(133)
DUMMY_HANDLER(134)
DUMMY_HANDLER(135)
DUMMY_HANDLER(136)
DUMMY_HANDLER(137)
DUMMY_HANDLER(138)
DUMMY_HANDLER(139)
DUMMY_HANDLER(140)
DUMMY_HANDLER(141)
DUMMY_HANDLER(142)
DUMMY_HANDLER(143)
DUMMY_HANDLER(144)
DUMMY_HANDLER(145)
DUMMY_HANDLER(146)
DUMMY_HANDLER(147)
DUMMY_HANDLER(148)
DUMMY_HANDLER(149)
DUMMY_HANDLER(150)
DUMMY_HANDLER(151)
DUMMY_HANDLER(152)
DUMMY_HANDLER(153)
DUMMY_HANDLER(154)
DUMMY_HANDLER(155)
DUMMY_HANDLER(156)
DUMMY_HANDLER(157)
DUMMY_HANDLER(158)
DUMMY_HANDLER(159)
DUMMY_HANDLER(160)
DUMMY_HANDLER(161)
DUMMY_HANDLER(162)
DUMMY_HANDLER(163)
DUMMY_HANDLER(164)
DUMMY_HANDLER(165)
DUMMY_HANDLER(166)
DUMMY_HANDLER(167)
DUMMY_HANDLER(168)
DUMMY_HANDLER(169)
DUMMY_HANDLER(170)
DUMMY_HANDLER(171)
DUMMY_HANDLER(172)
DUMMY_HANDLER(173)
DUMMY_HANDLER(174)
DUMMY_HANDLER(175)
DUMMY_HANDLER(176)
DUMMY_HANDLER(177)
DUMMY_HANDLER(178)
DUMMY_HANDLER(179)
DUMMY_HANDLER(180)
DUMMY_HANDLER(181)
DUMMY_HANDLER(182)
DUMMY_HANDLER(183)
DUMMY_HANDLER(184)
DUMMY_HANDLER(185)
DUMMY_HANDLER(186)
DUMMY_HANDLER(187)
DUMMY_HANDLER(188)
DUMMY_HANDLER(189)
DUMMY_HANDLER(190)
DUMMY_HANDLER(191)
DUMMY_HANDLER(192)
DUMMY_HANDLER(193)
DUMMY_HANDLER(194)
DUMMY_HANDLER(195)
DUMMY_HANDLER(196)
DUMMY_HANDLER(197)
DUMMY_HANDLER(198)
DUMMY_HANDLER(199)
DUMMY_HANDLER(200)
DUMMY_HANDLER(201)
DUMMY_HANDLER(202)
DUMMY_HANDLER(203)
DUMMY_HANDLER(204)
DUMMY_HANDLER(205)
DUMMY_HANDLER(206)
DUMMY_HANDLER(207)
DUMMY_HANDLER(208)
DUMMY_HANDLER(209)
DUMMY_HANDLER(210)
DUMMY_HANDLER(211)
DUMMY_HANDLER(212)
DUMMY_HANDLER(213)
DUMMY_HANDLER(214)
DUMMY_HANDLER(215)
DUMMY_HANDLER(216)
DUMMY_HANDLER(217)
DUMMY_HANDLER(218)
DUMMY_HANDLER(219)
DUMMY_HANDLER(220)
DUMMY_HANDLER(221)
DUMMY_HANDLER(222)
DUMMY_HANDLER(223)
DUMMY_HANDLER(224)
DUMMY_HANDLER(225)
DUMMY_HANDLER(226)
DUMMY_HANDLER(227)
DUMMY_HANDLER(228)
DUMMY_HANDLER(229)
DUMMY_HANDLER(230)
DUMMY_HANDLER(231)
DUMMY_HANDLER(232)
DUMMY_HANDLER(233)
DUMMY_HANDLER(234)
DUMMY_HANDLER(235)
DUMMY_HANDLER(236)
DUMMY_HANDLER(237)
DUMMY_HANDLER(238)
DUMMY_HANDLER(239)
DUMMY_HANDLER(240)
DUMMY_HANDLER(241)
DUMMY_HANDLER(242)
DUMMY_HANDLER(243)
DUMMY_HANDLER(244)
DUMMY_HANDLER(245)
DUMMY_HANDLER(246)
DUMMY_HANDLER(247)
DUMMY_HANDLER(248)
DUMMY_HANDLER(249)
DUMMY_HANDLER(250)
DUMMY_HANDLER(251)
DUMMY_HANDLER(252)
DUMMY_HANDLER(253)
DUMMY_HANDLER(254)
DUMMY_HANDLER(255)

typedef struct ArchThreadInfo
{
  uint32  eip;       // 0
  uint32  cs;        // 4
  uint32  eflags;    // 8
  uint32  eax;       // 12
  uint32  ecx;       // 16
  uint32  edx;       // 20
  uint32  ebx;       // 24
  uint32  esp;       // 28
  uint32  ebp;       // 32
  uint32  esi;       // 36
  uint32  edi;       // 40
  uint32  ds;        // 44
  uint32  es;        // 48
  uint32  fs;        // 52
  uint32  gs;        // 56
  uint32  ss;        // 60
  uint32  dpl;       // 64
  uint32  esp0;      // 68		call neo_%1
  uint32  ss0;       // 72
  uint32  cr3;       // 76
  uint32  fpu[27];   // 80
};

extern ArchThreadInfo *currentThreadInfo;
extern Thread *currentThread;

#define IRQ_HANDLER(x) extern "C" void arch_irqHandler_##x(); \
  extern "C" void irqHandler_##x ()  {  \
    kprintfd_nosleep("IRQ_HANDLER: Spurious IRQ " #x "\n"); \
    kprintf_nosleep("IRQ_HANDLER: Spurious IRQ " #x "\n"); \
    ArchInterrupts::EndOfInterrupt(x); \
  }; \

extern "C" void arch_irqHandler_0();
extern "C" void arch_switchThreadKernelToKernel();  
extern "C" void arch_switchThreadKernelToKernelPageDirChange();
extern "C" void arch_switchThreadToUserPageDirChange();
extern "C" void irqHandler_0()
{
  static uint32 heart_beat_value = 0;
  //~ static uint32 leds = 0;
  //~ static uint32 ctr = 0;
  char* fb = (char*)0xC00B8000;
  switch (heart_beat_value)
  {
    default:
    case 0:
    fb[0] = '/';
    fb[1] = 0x9f;
    break;
    case 1:
    fb[0] = '-';
    fb[1] = 0x9f;
    break;
    case 2:
    fb[0] = '\\';
    fb[1] = 0x9f;
    break;
    case 3:
